<!DOCTYPE html>
<style>
    body {
        background-image: url('images/1024.png');
        background-repeat: no-repeat;
        background-position: center;
        background-size: cover;
    }
</style>
<html>
    <body>
        <CENTER>
            <h1>Wibber</h1>
            <br>
			<h2>
			Om ni inte &auml;r Tibber kund s&aring; rekomenderar jag ist&auml;llet:
            <a href="https://johellstrand.github.io/powersave">powersave</a></h2>
			<br>
			<br>
			<br>

			<table>
				<tr>
					<td>
            F&aring; koll p&aring; elpriser och din egen f&ouml;rbrukning. Wibber &auml;r utvecklad f&ouml;r Apple Watch och h&auml;mtar sin data ifr&aring;n Tibber. Man m&aring;ste ha ett konto p&aring; Tibber med tillh&ouml;rande Access Token f&ouml;r att kunna anv&auml;nda appen.
			<br>
			<br>
			<br>
			1. Bli kund/Skapa konto hos Tibber. <a href="https://tibber.com/se">link</a><br>
			2. Skapa Access Token till ditt Tibber konto. <a href="https://developer.tibber.com/settings/access-token">link</a><br>
			3. Installera Wibber. <a href="https://apps.apple.com/us/app/poi/id1667089288">link</a><br>
                        4. Smeknamn p&aring; din bostad m&aring;ste vara skapat. Det g&ouml;r du i Tibber Appen under Mitt konto -> Mina Hem -> Smeknamn.
		</td>
	</tr>
	<tr>
		<td>
			5. Sl&aring; in AccessToken som du skapade i steg 2. Notera att stort i och 1 samt stort o och Noll kan vara v&auml;ldigt lika varandra i vissa fonter.<br>
			<img src="images/accesstoken.png" width="200">
			<br>
			Det enklaste s&auml;ttet &auml;r att skapa en texters&auml;ttningsfras i iPhonen, d&auml;r skapar man ett kortkommande f&ouml;r sitt Token. Det kan g&ouml;ras i iPhonen under Inst&auml;llningar->Allm&auml;nt->Tangentbord->Texters&auml;ttning (settings->general->keyboard->Text Replacement).
			Sen n&auml;r man promptas i klockan f&ouml;r token s&aring; anv&auml;nder man sin ers&auml;ttningsfras i iPhonen ist&auml;llet. P&aring; min telefon har jag skapat ers&auml;ttningfrasen atjhez, se:
			<br>
			<img src="images/phrase.png" width="200">
			<br>

			<br>
			<br>
			
		</td>
	</tr>
	<tr>
		<td>
			6. Om du slog in ett giltigt Access Token s&aring; kan du nu v&auml;lja med att g&aring; vidare med den just skapade Usern, genom att klicka p&aring; den, alternativt kan man skapa &auml;nnu en User och l&auml;gga till ytterligare en AccessToken.<br>
			<img src="images/selectuser.png" width="200">
			<br>
			<br>
			<br>
			
		</td>
	</tr>
	<tr>
		<td>
			7. Om du nu har klickat p&aring; den Usern som du skapade s&aring; skapas 3 nya Tabbar. F&ouml;rsta Tabben inneh&aring;ller:<br>
			<img src="images/wibber+/current.png" width="200"><br>
			Denna vy visar nuvarande spotpris (inkl till&auml;gg, skatt och moms). F&auml;rgen &auml;r gr&ouml;n om niv&aring;n p&aring; priset &auml;r "VERY_CHEAP" eller "CHEAP", Bl&aring; om priset &auml;r "NORMAL" och r&ouml;d om Priset &auml;r "EXPENSIVE" eller "VERY_EXPENSIVE". Definitionerna av niv&aring;erna kan ses h&auml;r <a href="https://developer.tibber.com/docs/reference#pricelevel">link</a>. Under linjen visas namnet p&aring; huset/lgh som du angivit i hos Tibber och tiden n&auml;r datan sist blev refreshad.
			<br>
			<br>
			<br>
			
		</td>
	</tr>
	<tr>
		<td>
			8. Andra Tabben inneh&aring;ller:<br>
			<img src="images/chart1.png" width="200"> &nbsp; <img src="images/chart1_swipe.png" width="200"> &nbsp; <img src="images/chart2.png" width="200"> &nbsp; <img src="images/chart3.png" width="200"> &nbsp; <img src="images/chart4.png" width="200"><br>
			Denna chart visar priset p&aring; elen p&aring; y axeln och tid p&aring; x axeln. Medelpriset anges med bl&aring; text och en horisontell linje. Skuggning under grafen g&aring;r fram till nuvarande tid. Om man svajpar sakta &ouml;ver grafen s&aring; visas priset ist&auml;llet f&ouml;r titeln. Om man klickar p&aring; grafen s&aring; visas grafen f&ouml;r vecka/m&aring;nad/&aring;r ist&auml;llet.
			<br>
			<br>
			<br>
			
		</td>
	</tr>
	<tr>
		<td>
			9. Sista Tabben visar data ang&aring;ende ditt konto.
			<br>
			
		</td>
	</tr>
	<tr>
		<td>
			10. Ny funktionalitet from version 1.55 och om man blir prenumerant så kommer även Complications, "Plugin Planning", Förbrukning och Kostnad per timme/dag/månad.
			<br>
			<b>Complications</b><br>
			<img src="images/wibber+/compl1.png" width="200">
			<img src="images/wibber+/compl2.png" width="200">
			<img src="images/wibber+/compl4.png" width="200">
			<img src="images/wibber+/compl5.png" width="200"><br>
			Första bilden nedre vänstra hörnet, corner widget, max pris tom midnatt är 282 och gauge pekar mot nuvarande pris.<br>
			Andra bilden längst ner, rectangular widget, Visar nuvarande pris i rött, kostnad för nuvarande månad exklusive idag och även graf över elprisets utveckling.<br>
			Tredje bilden längst ner, inline widget, visar nuvarande pris<br>
			Fjärde bilden ovan mitten, circular widget med text, visar nuvarande pris med gauge med förhållande till framtida maxpris och även kostnad för nuvarande månad exklusive idag.
			<br>
			<br>
			<b>Plugin planning</b><br>
			<img src="images/wibber+/ppv.png" width="200"><br>
			Använd snurrknappen för att stega antal timmar du behöver vara inkopplad (i detta exempel 5), sen visar appen vilken tid max ska plugga in för att minimera medlekostnaden.<br>
			<br>
			<br>
			
			<br>
			<br>
			<b>Elkostnader</b><br>
			<img src="images/wibber+/cost1.png" width="200">
			<img src="images/wibber+/cost2.png" width="200"><br>
			Visar kostnaden för idag, denna vecka, månad och ett år tillbaka. Klicka på bilden för att switcha.<br>
			<br>
			<br>
			<br>
			<br>
			<b>Försbrukning</b><br>
			<img src="images/wibber+/cons1.png" width="200">
			<img src="images/wibber+/cons2.png" width="200"><br>
			Visar förbrukningen för idag, denna vecka, månad och ett år tillbaka. Klicka på bilden för att switcha.<br>
			<br>
			<br>
		</td>
	</tr>
</table>
            <br>
            <br>Appen &auml;r ocks&aring; &ouml;versatt till Svenska.<br>
            <a href="mailto:iosappsupport@icloud.com">Mail for support</a>
            <br>
            <br>
            <br>
            <a href="https://apps.apple.com/us/app/poi/id1667089288"><img src="../images/appstore.svg" width="300"></a>
            <br>
            <br>
    </body>
</html>
